qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32F3XX/stm32f30x_tim.h
/** @defgroup TIM_Output_Compare_Preload_State 
  * @{
  */

#define TIM_OCPreload_Enable               ((uint16_t)0x0008)
#define TIM_OCPreload_Disable              ((uint16_t)0x0000)
#define IS_TIM_OCPRELOAD_STATE(STATE) (((STATE) == TIM_OCPreload_Enable) || \
                                       ((STATE) == TIM_OCPreload_Disable))
/**
  * @}
  */ 

/** @defgroup TIM_Output_Compare_Fast_State 
  * @{
  */

#define TIM_OCFast_Enable                  ((uint16_t)0x0004)
#define TIM_OCFast_Disable                 ((uint16_t)0x0000)
#define IS_TIM_OCFAST_STATE(STATE) (((STATE) == TIM_OCFast_Enable) || \
                                    ((STATE) == TIM_OCFast_Disable))
                                     
/**
  * @}
  */ 

/** @defgroup TIM_Output_Compare_Clear_State 
  * @{
  */

#define TIM_OCClear_Enable                 ((uint16_t)0x0080)
#define TIM_OCClear_Disable                ((uint16_t)0x0000)
#define IS_TIM_OCCLEAR_STATE(STATE) (((STATE) == TIM_OCClear_Enable) || \
                                     ((STATE) == TIM_OCClear_Disable))
/**
  * @}
  */ 

/** @defgroup TIM_Trigger_Output_Source 
  * @{
  */

#define TIM_TRGOSource_Reset               ((uint16_t)0x0000)
#define TIM_TRGOSource_Enable              ((uint16_t)0x0010)
#define TIM_TRGOSource_Update              ((uint16_t)0x0020)
#define TIM_TRGOSource_OC1                 ((uint16_t)0x0030)
#define TIM_TRGOSource_OC1Ref              ((uint16_t)0x0040)
#define TIM_TRGOSource_OC2Ref              ((uint16_t)0x0050)
#define TIM_TRGOSource_OC3Ref              ((uint16_t)0x0060)
#define TIM_TRGOSource_OC4Ref              ((uint16_t)0x0070)
#define IS_TIM_TRGO_SOURCE(SOURCE) (((SOURCE) == TIM_TRGOSource_Reset) || \
                                    ((SOURCE) == TIM_TRGOSource_Enable) || \
                                    ((SOURCE) == TIM_TRGOSource_Update) || \
                                    ((SOURCE) == TIM_TRGOSource_OC1) || \
                                    ((SOURCE) == TIM_TRGOSource_OC1Ref) || \
                                    ((SOURCE) == TIM_TRGOSource_OC2Ref) || \
                                    ((SOURCE) == TIM_TRGOSource_OC3Ref) || \
                                    ((SOURCE) == TIM_TRGOSource_OC4Ref))


#define TIM_TRGO2Source_Reset                             ((uint32_t)0x00000000)
#define TIM_TRGO2Source_Enable                            ((uint32_t)0x00100000)
#define TIM_TRGO2Source_Update                            ((uint32_t)0x00200000)
#define TIM_TRGO2Source_OC1                               ((uint32_t)0x00300000)
#define TIM_TRGO2Source_OC1Ref                            ((uint32_t)0x00400000)
#define TIM_TRGO2Source_OC2Ref                            ((uint32_t)0x00500000)
#define TIM_TRGO2Source_OC3Ref                            ((uint32_t)0x00600000)
#define TIM_TRGO2Source_OC4Ref                            ((uint32_t)0x00700000)
#define TIM_TRGO2Source_OC5Ref                            ((uint32_t)0x00800000)
#define TIM_TRGO2Source_OC6Ref                            ((uint32_t)0x00900000)
#define TIM_TRGO2Source_OC4Ref_RisingFalling              ((uint32_t)0x00A00000)
#define TIM_TRGO2Source_OC6Ref_RisingFalling              ((uint32_t)0x00B00000)
#define TIM_TRGO2Source_OC4RefRising_OC6RefRising         ((uint32_t)0x00C00000)
#define TIM_TRGO2Source_OC4RefRising_OC6RefFalling        ((uint32_t)0x00D00000)
#define TIM_TRGO2Source_OC5RefRising_OC6RefRising         ((uint32_t)0x00E00000)
#define TIM_TRGO2Source_OC5RefRising_OC6RefFalling        ((uint32_t)0x00F00000)
#define IS_TIM_TRGO2_SOURCE(SOURCE) (((SOURCE) == TIM_TRGO2Source_Reset) || \
                                     ((SOURCE) == TIM_TRGO2Source_Enable) || \
                                     ((SOURCE) == TIM_TRGO2Source_Update) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC1) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC1Ref) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC2Ref) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC3Ref) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC4Ref) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC5Ref) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC6Ref) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC4Ref_RisingFalling) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC6Ref_RisingFalling) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC4RefRising_OC6RefRising) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC4RefRising_OC6RefFalling) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC5RefRising_OC6RefRising) || \
                                     ((SOURCE) == TIM_TRGO2Source_OC5RefRising_OC6RefFalling))
/**
  * @}
  */ 

/** @defgroup TIM_Slave_Mode 
  * @{
  */

#define TIM_SlaveMode_Reset                       ((uint32_t)0x00004)
#define TIM_SlaveMode_Gated                       ((uint32_t)0x00005)
#define TIM_SlaveMode_Trigger                     ((uint32_t)0x00006)
#define TIM_SlaveMode_External1                   ((uint32_t)0x00007)
#define TIM_SlaveMode_Combined_ResetTrigger       ((uint32_t)0x10000)
#define IS_TIM_SLAVE_MODE(MODE) (((MODE) == TIM_SlaveMode_Reset) || \
                                 ((MODE) == TIM_SlaveMode_Gated) || \
                                 ((MODE) == TIM_SlaveMode_Trigger) || \
                                 ((MODE) == TIM_SlaveMode_External1) || \
                                 ((MODE) == TIM_SlaveMode_Combined_ResetTrigger))
/**
  * @}
  */ 

/** @defgroup TIM_Master_Slave_Mode 
  * @{
  */

#define TIM_MasterSlaveMode_Enable         ((uint16_t)0x0080)
#define TIM_MasterSlaveMode_Disable        ((uint16_t)0x0000)
#define IS_TIM_MSM_STATE(STATE) (((STATE) == TIM_MasterSlaveMode_Enable) || \
                                 ((STATE) == TIM_MasterSlaveMode_Disable))
/**
  * @}
  */ 
/** @defgroup TIM_Remap 
  * @{
  */
#define TIM16_GPIO                      ((uint16_t)0x0000)
#define TIM16_RTC_CLK                   ((uint16_t)0x0001)
#define TIM16_HSEDiv32                  ((uint16_t)0x0002)
#define TIM16_MCO                       ((uint16_t)0x0003)

#define TIM1_ADC1_AWDG1                ((uint16_t)0x0001)
#define TIM1_ADC1_AWDG2                ((uint16_t)0x0002)
#define TIM1_ADC1_AWDG3                ((uint16_t)0x0003)
#define TIM1_ADC4_AWDG1                ((uint16_t)0x0004)
#define TIM1_ADC4_AWDG2                ((uint16_t)0x0008)
#define TIM1_ADC4_AWDG3                ((uint16_t)0x000C)

#define TIM8_ADC2_AWDG1                ((uint16_t)0x0001)
#define TIM8_ADC2_AWDG2                ((uint16_t)0x0002)
#define TIM8_ADC2_AWDG3                ((uint16_t)0x0003)
#define TIM8_ADC3_AWDG1                ((uint16_t)0x0004)
#define TIM8_ADC3_AWDG2                ((uint16_t)0x0008)
#define TIM8_ADC3_AWDG3                ((uint16_t)0x000C)

